ConfigFiles/Enums/СрочностьИсправленияОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СрочностьИсправленияОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Немедленно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖелательноБыстрее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПлановомПорядке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/СтатусыОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗарегистрирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Признана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетИсправленияПовторяемойОшибки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверенаИсправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПризнана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПланируетсяИсправлять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Comment>Файлы в папках</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификацииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекущаяВерсияДатаМодификацииФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекущаяВерсияДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекущаяВерсияКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекущаяВерсияНомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипХраненияФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публикуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьСертификатыШифрования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/CommonModules/ОбщегоНазначенияСППРВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

//Получает проект объекта из его реквизитов или из реквизитов в структуре подчиненности владельцам
//
// Параметры:
//  Объект  - СправочникСсылка - Ссылка на объект, проект которого требуется определить
//
// Возвращаемое значение:
//  Проект - СправочникСсылка.Проекты - проект объекта
//
Функция ПроектОбъекта(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.ФормыОбъектовМетаданных") Тогда
		
		Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "Владелец");
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ЭлементыСправки") Тогда
		
		ВладелецЭлемента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "Владелец");
		
		Если ТипЗнч(ВладелецЭлемента) = Тип("СправочникСсылка.ФормыОбъектовМетаданных") Тогда
			Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецЭлемента.Владелец, "Владелец");
		Иначе
			Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецЭлемента, "Владелец");
		КонецЕсли;
		
	Иначе
		Если ЗначениеЗаполнено(Объект) Тогда
			Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "Владелец");
		Иначе
			Проект = Справочники.Проекты.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Проект;
	
КонецФункции

//Получает проект объекта из его реквизитов или из реквизитов в структуре подчиненности владельцам
//
// Параметры:
//  ИмяКласса - Строка - строка, определяющая имя класса объекта метаданных ("Справочники", "Документы" и т.д.)
//  Проект  - СправочникСсылка.Проекты - Ссылка на проект, для которого требуется получить группу.
//
// Возвращаемое значение:
//  Группа - СправочникСсылка.Объекты метаданных - группа справочника "ОбъектыМетаданных".
//
Функция ГруппаОбъектовМетаданных(ИмяКласса, Проект) Экспорт
	
	Возврат РаботаСОбъектамиМетаданных.ГруппаОбъектовМетаданных(ИмяКласса, Проект);
	
КонецФункции

Функция СписокШаблоновИнформационныхБазОшибки(Ошибка) Экспорт 

	СписокШаблонов = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Ошибка) Тогда
		
		СписокДоступныхРасширений = Новый Массив;
		СписокДоступныхРасширений.Добавить("dt");
		СписокДоступныхРасширений.Добавить("cf");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Файлы.Ссылка КАК Ссылка,
		|	Файлы.Расширение КАК Расширение
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	НЕ Файлы.ПометкаУдаления
		|	И Файлы.ВладелецФайла = &Ошибка
		|	И Файлы.Расширение В(&СписокДоступныхРасширений)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Файлы.Расширение,
		|	Файлы.Наименование,
		|	Ссылка";
		
		Запрос.УстановитьПараметр("Ошибка", Ошибка);
		Запрос.УстановитьПараметр("СписокДоступныхРасширений", СписокДоступныхРасширений);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокШаблонов.Добавить(ВыборкаДетальныеЗаписи.Ссылка, Строка(ВыборкаДетальныеЗаписи.Ссылка) + " (."+ ВыборкаДетальныеЗаписи.Расширение + ")");
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат СписокШаблонов;
	
КонецФункции

//Выполняет необходимые действия посленачала работы системы и возвращает необходимые параметры,
// определяющие дальнейшие действия
//
// Возвращаемое значение:
//  Параметры - Структура  - структура, содержащая следующие параметры:
//  * ВыполнятьОповещение - Булево - признак необходимости оповещений пользователя о наличии ошибок к немедленной отработке.
//  * ИнтервалОповещений - Число - интервал оповещений (в минутах) о наличии ошибок к немедленной отработке.
//
Функция ВыполнитьДействияПослеНачалаРаботыСистемы() Экспорт
	
	ОчиститьБуферОбмена();
	
	// Определение настроек оповещений по ошибкам с немедленной отработкой
	НастройкиОповещенийПоОшибкамСНемедленнойОбработкой = НастройкиОповещенийОбОшибкахСНемедленнойОтработкой();
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("ВыполнятьОповещениеОНаличииОшибок", НастройкиОповещенийПоОшибкамСНемедленнойОбработкой.ВыполнятьОповещение);
	Параметры.Вставить("ИнтервалОповещенийОНаличииОшибок", НастройкиОповещенийПоОшибкамСНемедленнойОбработкой.ИнтервалОповещений);
	Параметры.Вставить("ЕстьПравоДоступаКОшибкам", НастройкиОповещенийПоОшибкамСНемедленнойОбработкой.ЕстьПравоДоступа);
	
	// Определение настроек напоминаний по событиям календаря
	НастройкиНапоминанийПоСобытиямКалендаря = НастройкиНапоминанийПоСобытиямКалендаря();
	Параметры.Вставить("ИспользоватьНапоминанияОСобытияхКалендаря", НастройкиНапоминанийПоСобытиямКалендаря.ИспользоватьНапоминания);
	Параметры.Вставить("ИнтервалНапоминанийОСобытияхКалендаря", НастройкиНапоминанийПоСобытиямКалендаря.ИнтервалНапоминаний);
	
	Возврат Параметры;
	
КонецФункции
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Очищает содержимое хранилища буфера обмена
//
Процедура ОчиститьБуферОбмена() Экспорт
	
	ХранилищаНастроек.ХранилищеБуфераОбмена.ОчиститьБуферОбмена();
	
КонецПроцедуры

//Получает настройки оповещений о наличии ошибок, требующих отработки немедленно
//
// Возвращаемое значение:
//  Настройки - Структура  - структура, содержащая настройки, со следующими полями:
//  * ВыполнятьОповещение - Булево - признак необходимости оповещений.
//  * ИнтервалОповещений - Число - интервал оповещений (в минутах).
//
Функция НастройкиОповещенийОбОшибкахСНемедленнойОтработкой()
	
	ЕстьПравоДоступа = ПравоДоступа("Редактирование", Метаданные.Справочники.Ошибки);
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ВыполнятьОповещение", Ложь);
	СтруктураРезультата.Вставить("ИнтервалОповещений", 0);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ИнтервалОповещенийОНаличииОшибокДляНемедленнойОтработки.Значение КАК ИнтервалОповещений,
	|	ОповещатьОНаличииОшибокСНемедленнойОтработкой.Значение КАК ВыполнятьОповещение
	|ИЗ
	|	Константа.ОповещатьОНаличииОшибокСНемедленнойОтработкой КАК ОповещатьОНаличииОшибокСНемедленнойОтработкой,
	|	Константа.ИнтервалОповещенийОНаличииОшибокДляНемедленнойОтработки КАК ИнтервалОповещенийОНаличииОшибокДляНемедленнойОтработки"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, Выборка);
	КонецЕсли;
	
	СтруктураРезультата.Вставить("ЕстьПравоДоступа", ЕстьПравоДоступа);
		
	Возврат СтруктураРезультата;
	
КонецФункции

Функция НастройкиНапоминанийПоСобытиямКалендаря()
	
	ИмяОбъекта = "НастройкиКалендаряПользователя";
	
	ИспользоватьНапоминания = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяОбъекта, "НапоминатьОСобытияхКалендаря", Ложь);
	
	Если ИспользоватьНапоминания Тогда
		ИнтервалНапоминаний = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяОбъекта, "ИнтервалНапоминаний", 0);
	Иначе
		ИнтервалНапоминаний = 0;
	КонецЕсли;
	
	НастройкиНапоминаний = Новый Структура;
	НастройкиНапоминаний.Вставить("ИспользоватьНапоминания", ИспользоватьНапоминания);
	НастройкиНапоминаний.Вставить("ИнтервалНапоминаний", ИнтервалНапоминаний);
	
	Возврат НастройкиНапоминаний;
	
КонецФункции

Функция КоличествоОшибокТребующиеНемедленнойОбработкиПользователем() Экспорт
	
	Количество = 0;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(ВЫБОР
	|			КОГДА Ошибки.СрокОтработки < &ДатаЗавтра
	|					И Ошибки.СрочностьИсправления = ЗНАЧЕНИЕ(Перечисление.СрочностьИсправленияОшибок.Немедленно)
	|					И НЕ(Ошибки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОшибок.Закрыта)
	|							ИЛИ Ошибки.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыОшибок.ПроверенаИсправлена), ЗНАЧЕНИЕ(Перечисление.СтатусыОшибок.Отозвана))
	|								И (НЕ Ошибки.Владелец.ИспользоватьЗакрытиеОшибок
	|									ИЛИ Ошибки.Владелец.ИспользоватьЗакрытиеТолькоДляОшибокСПроектнымиИзменениями
	|										И НЕ Ошибки.ЕстьИзмененияПоСравнениюСРанееПринятымиПроектнымиРешениями))
	|				ТОГДА Ошибки.Ссылка
	|		КОНЕЦ) КАК Количество
	|ИЗ
	|	Справочник.Ошибки КАК Ошибки
	|ГДЕ
	|	НЕ Ошибки.ПометкаУдаления
	|	И Ошибки.КомуНаправлена = &ТекущийПользователь"
	;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ТекущаяДата = НачалоДня(Текущаядата());
	
	ДатаЗавтра = ОбщегоНазначенияСППР.СледующаяДатаПоОсновномуКалендарю();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("ДатаЗавтра", ДатаЗавтра);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Количество = Выборка.Количество;
	КонецЕсли;
	
	Возврат Количество;
	
КонецФункции

Функция ДанныеСобытийКалендаряДляНапоминаний() Экспорт
	
	Результат = Новый Массив;
	
	ДанныеСобытий = КалендариПользователей.СобытияКалендаряДляНапоминаний();
	
	Для Каждого ДанныеСобытия из ДанныеСобытий Цикл
		
		ОписаниеСобытия = Новый Структура;
		ОписаниеСобытия.Вставить("Пользователь", ДанныеСобытия.Пользователь);
		ОписаниеСобытия.Вставить("ИдентификаторЗаписи", ДанныеСобытия.ИдентификаторЗаписи);
		ОписаниеСобытия.Вставить("Название", ДанныеСобытия.Название);
		ОписаниеСобытия.Вставить("Работа", ДанныеСобытия.Работа);
		ОписаниеСобытия.Вставить("Начало", ДанныеСобытия.Начало);
		
		Результат.Добавить(ОписаниеСобытия);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
